OdGeMatrix2d.entry
\details
Matrix data by rows.

OdGeMatrix2d.op_FunctionCall(System.Int32,System.Int32)
\details
Returns matrix.entry[row][column] as matrix(row,column).
\param row [in]  Row.
\param column [in]  Column.
\returns Matrix element.
\details
References matrix.entry[row][column] as matrix(row,column).
\param row [in]  Row.
\param column [in]  Column.
\returns Reference to the matrix element.

OdGeMatrix2d.op_Subscript(System.Int32)
\details
Returns matrix.entry[row] as matrix[row].
\param row [in]  Row.
\returns Pointer to the constant matrix row.
\details
References matrix.entry[row] as matrix[row].
\param row [in]  Row.
\returns Pointer to the matrix row.

OdGeMatrix2d.alignCoordSys(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps
the  coordinate system defined by fromOrigin, fromXAxis, and fromYAxis,
to the coordinate system
defined by toOrigin, toXAxis, and toYAxis.
\param fromOrigin [in]  Origin of the initial coordinate system.
\param fromXAxis [in]  X-axis of the initial coordinate system.
\param fromYAxis [in]  Y-axis of the initial coordinate system.
\param toOrigin [in]  Origin of the initial coordinate system.
\param toXAxis [in]  X-axis of the initial coordinate system.
\param toYAxis [in]  Y-axis of the initial coordinate system.

OdGeMatrix2d.mirroring(OdGeLine2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which mirrors
about the specified object.
\param mirrorLine [in]  Mirror line entity.

OdGeMatrix2d.mirroring(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which mirrors
about the specified object.
\param mirrorPoint [in]  Mirror point.

OdGeMatrix2d.scaling(OdGeScale2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that scales entities by a scale factor relatively to the
center.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Scaling matrix.

OdGeMatrix2d.scaling(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that scales entities by a scale factor relatively to the
center.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Scaling matrix.

OdGeMatrix2d.rotation(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which rotates
by angle about center.
\param angle [in]  Rotation angle.
\param center [in]  Center of rotation.

OdGeMatrix2d.setToAlignCoordSys(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps
the coordinate system defined by fromOrigin, fromXAxis, and fromYAxis,
to the coordinate system
defined by toOrigin, toXAxis, and toYAxis, and returns a reference
to this matrix.
\param fromOrigin [in]  Origin of the initial coordinate system.
\param fromXAxis [in]  X-axis of the initial coordinate system.
\param fromYAxis [in]  Y-axis of the initial coordinate system.
\param toOrigin [in]  Origin of the initial coordinate system.
\param toXAxis [in]  X-axis of the initial coordinate system.
\param toYAxis [in]  Y-axis of the initial coordinate system.

OdGeMatrix2d.setToMirroring(OdGeLine2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorLine [in]  Mirror line entity.

OdGeMatrix2d.setToMirroring(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorPoint [in]  Mirror point.

OdGeMatrix2d.setToScaling(OdGeScale2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is scaled by a scale factor about the
center of scaling, and returns a reference to this matrix.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Reference to this matrix.

OdGeMatrix2d.setToScaling(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is scaled by a scale factor about the
center of scaling, and returns a reference to this matrix.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Reference to this matrix.

OdGeMatrix2d.setToRotation(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which rotates
by angle about center, and returns a reference
to this matrix.
\param angle [in]  Rotation angle.
\param center [in]  Center of rotation.

OdGeMatrix2d.setToTranslation(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which translates
by vect, and returns a reference
to this matrix.
\param vect [in]  Translation vector.

OdGeMatrix2d.getCoordSystem(OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the origin, X-axis, and Y-axis of the coordinate system
to which this matrix maps the WCS.
\param origin [out]  Receives the origin of the coordinate system.
\param xAxis [out]  Receives the X-axis of the coordinate system.
\param yAxis [out]  Receives the Y-axis of the coordinate system.

OdGeMatrix2d.setCoordSystem(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps
the WCS to the coordinate system
defined by origin, X-axis, and Y-axis, and returns a reference
to this matrix.
\param origin [in]  Origin of the coordinate system.
\param xAxis [in]  X-axis of the coordinate system.
\param yAxis [in]  Y-axis of the coordinate system.

OdGeMatrix2d.isConformal(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if an only if this matrix is conformal (isUniScaledOrtho()),
and returns the scale factor, angle of rotation,
the presence of a mirror component to the matrix,
and the direction of reflection.
\param scale [out]  Receives the scale factor.
\param angle [out]  Receives the angle of rotation.
\param isMirror [out]  Receives true if and only if the matrix has a mirror component.
\param reflex [in]  Direction of reflection.
\remarks
reflex is valid if and only if isMirror is true.
\returns
true if this matrix is conformal, false otherwise.

OdGeMatrix2d.translation(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix of the translation by vector.
\param vector [in]  Translation vector.

OdGeMatrix2d.translation
\details
Returns the translation vector of this matrix.

OdGeMatrix2d.setTranslation(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the translation part of the matrix to the specified vector.
\param vect [in]  Translation vector.

OdGeMatrix2d.det
\details
Returns the determinant of this matrix.

OdGeMatrix2d.scale
\details
Returns the scale factor of this matrix.
\remarks
The scale factor is the square root of the longest column vector
of the linear part of this matrix.

OdGeMatrix2d.isScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only the column vectors of the linear part of
this matrix are perpendicular
to each other within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeMatrix2d.isUniScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only the columns vectors of the linear part of
this matrix are of equal length and perpendicular
to each other  within the
specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeMatrix2d.isEqualTo(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if matrix is identical to this one,
within the specified tolerance.
\param matrix [in]  Matrix to be compared.
\param tol [in]  Geometric tolerance.

OdGeMatrix2d.op_Inequality(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator.
\param matrix [in]  Other matrix to compare.
\returns
A boolean value that indicates whether the input matrix is not identical to this matrix.

OdGeMatrix2d.op_Equality(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator.
\param matrix [in]  Other matrix to compare.
\returns
A boolean value that indicates whether the input matrix is identical to this matrix.

OdGeMatrix2d.transpose
\details
Returns the transpose of this matrix.

OdGeMatrix2d.transposeIt
\details
Sets this matrix to its transpose, and returns
a reference to this matrix.

OdGeMatrix2d.isSingular(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether this matrix is singular.
\param tol      [in]  Geometric tolerance.
\returns
true if this matrix is singular, false otherwise.
\remarks
* A matrix is singular if and only if its determinant is zero within the specified tolerance.
* A singular matrix cannot be inverted.

OdGeMatrix2d.inverse
\details
Returns the inverse of this matrix.

OdGeMatrix2d.invert
\details
Sets this matrix to its inverse, and returns
a reference to this matrix.

OdGeMatrix2d.setToProduct(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product matrix1 * matrix2, and returns
a reference to this matrix.
\param matrix1 [in]  First 2D matrix that is multiplied.
\param matrix2 [in]  Second 2D matrix that is multiplied.

OdGeMatrix2d.postMultBy(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product (this matrix) * rightSide, and returns
a reference to this matrix.
\param rightSide [in]  2D matrix that will be multiplied with this matrix.
\remarks
Note that when multiplying matrices, the order matters. This method provides different results than preMultBy even with the same parameters.

OdGeMatrix2d.preMultBy(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product leftSide * (this matrix), and returns
a reference to this matrix.
\param leftSide [in]  2D matrix that will be multiplied with this matrix.
\remarks
Note that when multiplying matrices, the order matters. This method provides different results than postMultBy even with the same parameters.

OdGeMatrix2d.op_MultiplicationAssignment(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this matrix to the product (this matrix) * matrix, and returns
a reference to this matrix.
\param matrix      [in]  Matrix to the right of the operand.
\returns
A reference to this OdGeMatrix2d object.

OdGeMatrix2d.op_Multiply(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the product (this matrix) * matrix.
\param matrix      [in]  Matrix to the right of the operand.
\returns
The resulting matrix.

OdGeMatrix2d.setToIdentity
\details
Sets this matrix to the identity matrix, and returns a reference to this matrix.

OdGeMatrix2d.kIdentity
\details
The identity matrix.

OdGeMatrix2d.#ctor
\details
Default constructor for the OdGeMatrix2d class.
\remarks
Constructs a matrix for 2D transformation operations and sets it to the identity.